The  PipePlumbingFixtureFlowData  type exposes the following members.
 Properties
Name  |   Description
DimensionFlow
 The dimension flow which is used to calculate flow of the pipe. Units: (gal/min).
FixtureUnits
 The fixture units of the pipe.
Flow
 The actual flow of the plumbing fixture converted from dimension flow or fixture unit. Units: (gal/min).
FlowConfiguration
 The flow configuration mode of the pipe.
FlowConversionMode
 The flow conversion mode of the pipe.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 See Also
  PipePlumbingFixtureFlowData Class
  Autodesk.Revit.DB.Plumbing Namespace